// # Седмица 4 - Java Script в дълбочина 
// # =================================================================================================================

// Преговор
//  създайте функция която приема масив от обекти съдържащи свойствата min, max, avg
// * да се върнат всички обекти чиито min свойства са по-големи от 10
// * да се върнат всички обекти сумата на които min и max е четно число
// * да се върнат всички обекти които нямат avg свойство или то е нулева стойност


// Създайте обект, потребител, който съдържа следните свойства 
// * първо име
// * фамилия
// * факултетен номер
// * възраст
// * родно място
// * списък с изучавани дисциплини


// създайте инстанция на обекта с вашето име и дефинирайте стойности които са характерни за вас

// да се създаде форма за добавяне на потребители

// да се създаде, форма за визуализация на потребители