// # Седмица 3 - Java Script в дълбочина 
// # ======================================================================================================================

// Създайте функция, която намира всички тройки в подадена като единствен аргумент колекция и връща масив съдържащ всички намерени елементи на квадрат, 
// ако няма тройки нека връща празен масив. 
// * Направете проверка дали подаденият аргумент е точно един. Ако е нарушено условието функцията връща празен масив
// * Направете проверка дали подаденият аргумент е от правилният тип.


// създайте обект наречен CollectionUtil, който ще съдържа функции за работа с колекции.  
// * добавете функция която да обхожда масиви и да визуализира резултата от тях по произволен начин
// * добавете функция fuilter която приема колекция и връща нова на базата на някакво филтриращо условие
// * добавете функция map която приема колекция и връща нова на базата на произволно мапиращо условие


// Микро проект 
// Да се създаде система за управление на стокови наличности 
// Имате следните обекти
// * телевизор
// * пералня
// * радио

// да се създаде механизъм за добавяне изтриване ъпдейт на стоки 
// да се добави механизъм за търсене на определена стока